In [1]:
import pandas as pd

In [2]:
# 1. Remove spaces in dataframe columns.

salary_data = {
    "people":['John', 'Peter', 'Sam'],
    "salary":[' 50 ', '   40 ', '33     ']
}

In [3]:
salary = pd.DataFrame(salary_data)
print(salary)

  people   salary
0   John      50
1  Peter      40
2    Sam  33

In [4]:
def whitespace_remover(df):
    for i in df.columns:
        if df[i].dtype == 'object':
            df[i] = df[i].map(str.strip)
    return df

In [5]:
salary = whitespace_remover(salary)
print(salary)

  people salary
0   John     50
1  Peter     40
2    Sam     33

In [6]:
# 2. Remove `None` values from dataframe rows.
salary_data = {
    "people":['John', 'Peter', 'Sam'],
    "salary":[' 50 ', None, '33     ']
}
salary = pd.DataFrame(salary_data)
print(salary)

  people   salary
0   John      50
1  Peter     None
2    Sam  33

In [7]:
salary_none = salary[salary.isna().any(axis=1)]
salary_none

  people salary
1  Peter   None

In [8]:
salary_without_none = salary.dropna()
salary_without_none

  people   salary
0   John      50
2    Sam  33

In [9]:
# 3. Filter dataframes, based on values.

salary_data = {
    "people":['John', 'Peter', 'Sam', 'Vitosh', 'Karolina'],
    "salary":[50,44, 33, 101, 230]
}
salary = pd.DataFrame(salary_data)
print(salary)

     people  salary
0      John      50
1     Peter      44
2       Sam      33
3    Vitosh     101
4  Karolina     230

In [10]:
salary_above_100 = salary.loc[salary['salary']>100]
salary_below_100 = salary.loc[salary['salary']<100]

In [11]:
print(salary_above_100)

     people  salary
3    Vitosh     101
4  Karolina     230

In [12]:
print(salary_below_100)

  people  salary
0   John      50
1  Peter      44
2    Sam      33